cf_billing/Documents/энргУстановитьКоличествоСобственников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьКоличествоСобственников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргКоличествоСобственников</xr:Item>
				<xr:Item>InformationRegister.УдалитьэнгрЗначенияНормативовПотребленияАбонентов</xr:Item>
				<xr:Item>InformationRegister.энргКоличествоЖильцов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредыдущееКоличествоСобственников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнформацияОСобственниках</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИОСобственника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСобственника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеЖильцов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Enums/энргТипыПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргТипыПомещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Квартира</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комната</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КойкоМесто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НежилоеПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальнаяКвартира</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Секция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Участок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргУстановитьКоличествоСобственников/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает пустой массив плательщиков.
// 
// Возвращаемое значение:
//   Массив.
//
Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
		
	Возврат МассивПлательщиков;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
		
	Ответственный = Пользователи.ТекущийПользователь();		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= КонецДня(ДатаФактическогоСобытия);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= МоментВремени();
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	ЛСОТкрыт 		= энргПроверкаДанныхАбонентаСервер.СостояниеЛС(Момент,Абонент,Район,Организация);
			
	МКДОткрыт 		= Истина;

	Если НЕ ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор тогда		
		Строение 		= ДополнительныеСвойства.ДанныеСтроения.Строение;
		МКДОткрыт 		= энргПроверкаДанныхАбонентаСервер.СостояниеМКД(Момент,Район,Строение,Организация);			
	КонецЕсли;
	
	Если не ЛСОТкрыт тогда
		Отказ= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " лицевой счет закрыт");
	КонецЕсли;
	
	Если не МКДОткрыт тогда
		Отказ= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " мкд закрыт");
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;	
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки = ДанныеШапки();	
	
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьКоличествоСобственников(ДанныеШапки, Движения);
	
	ПолучаемыеСвойства  = Новый Структура("ТипПомещения, КлючПомещенияРодителя");
	энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаПомещения(Организация,Район,КлючПомещения,?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата),ПолучаемыеСвойства);
	
	Если ПолучаемыеСвойства.ТипПомещения = Перечисления.энргТипыПомещений.Комната И ПолучаемыеСвойства.КлючПомещенияРодителя <> Неопределено Тогда
		
		энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьКоличествоЖильцов(ДанныеШапки,ПолучаемыеСвойства.КлючПомещенияРодителя,Движения);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);   
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("КлючПомещения",			КлючПомещения);
	ДанныеШапки.Вставить("Абонент",					Абонент);
	ДанныеШапки.Вставить("КоличествоСобственников",	Количество);
	ДанныеШапки.Вставить("КоличествоЖильцов",		ПолучитьКоличествоЖильцов());

	Возврат ДанныеШапки; 
КонецФункции

Функция ПолучитьКоличествоЖильцов()
	
	ДатаГраницы 		= ?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		МоментВремени 	= Новый МоментВремени(ДатаГраницы, Ссылка);
	Иначе
		МоментВремени 	= ДатаГраницы;
	КонецЕсли;
	
	ПолучаемыеСвойства  = Новый Структура("КоличествоПрописанных, КоличествоПроживающих");
	энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаПомещения(Организация,Район,КлючПомещения,МоментВремени,ПолучаемыеСвойства);

	
	Если ПолучаемыеСвойства.КоличествоПрописанных = Неопределено Тогда
		КоличествоЖильцов = ?(ПолучаемыеСвойства.КоличествоПроживающих = Неопределено, Количество, ПолучаемыеСвойства.КоличествоПроживающих);
	Иначе
		КоличествоЖильцов = ПолучаемыеСвойства.КоличествоПрописанных;
	КонецЕсли;
	
	Возврат КоличествоЖильцов;	
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
